/* REXX */
/*ISPEXEC DISPLAY*/
/* ARG OPTIONS */
ADDRESS ISPEXEC
"LIBDEF ISPPLIB DATASET ID('D.SYSTEM.A09.PANEL')" /* DYNAMICALLY ALLOCATES PANEL LIBRARY */
IF LENGTH(ZSEL)<>0 THEN DO WHILE ZCMD <> 0
"DISPLAY PANEL(SMSOPER)"
IF ZCMD = "CANCEL" THEN EXIT 0
IF RC > 0 THEN EXIT 4
CALL CLEAR
END
 
CLEAR:
ARGS=''
ZSEL=''
IF ZCMD <> 0 THEN ZCMD=''
ST=''
SYST=''
DISK=''
RETURN
